Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you are looking for Jakarta REST, Servlet or Vert.x support for Google Cloud Functions, we have it thanks to our xref:gcp-functions-http.adoc[Google Cloud Functions HTTP binding].
ja_jp: Google Cloud Functionsの Jakarta REST、Servlet、Vert.xのサポートを探しているなら、 xref:gcp-functions-http.adoc[Google Cloud Functions HTTP binding] が存在します。

source: If you are looking for a provider-agnostic implementation of your Google Cloud Functions, we have it thanks to our xref:funqy-gcp-functions.adoc[Funqy Google Cloud Functions extension].
ja_jp: プロバイダーに依存しないGoogle Cloud Functionsの実装をお探しでしたら、 link:funqy-gcp-functions.html[Funqy Google Cloud Functionsエクステンション] をご利用ください。

source: If you are looking for small container images, the https://github.com/GoogleContainerTools/distroless[distroless] approach reduces the size of the base layer. The idea behind _distroless_ is the usage of a single and minimal base image containing all the requirements, and sometimes even the application itself.
ja_jp: 小さなコンテナーイメージを探している場合は、 https://github.com/GoogleContainerTools/distroless[distroless] アプローチでベースレイヤーのサイズが縮小されます。 _distroless_ の背後には、すべての要件 (場合によってはアプリケーション自体) を含む単一の最小限のベースイメージを使用するという考え方があります。

source: If you are looking for stateless CSRF prevention that does not involve the server creating a cookie, have a look at the xref:security-cors.adoc#cors-filter[CORS filter]. Despite its name it also offers CSRF prevention by checking whether a request's `Origin` either matches the target `Host` or is in a list of allowed origins server-side.
ja_jp: サーバーがクッキーを作成しないステートレスな CSRF 防止策をお探しの場合は、 xref:security-cors.adoc#cors-filter[CORS フィルター] をご覧ください。その名前にもかかわらず、リクエストの `Origin` がターゲット `Host` と一致するか、許可されたオリジンのサーバーサイドリストに含まれているかをチェックすることで、CSRF 防止策も提供します。

source: If you are looking to use Quarkus for a web application, look at the xref:web.adoc[Quarkus for the Web] guide.
ja_jp: Quarkus を Web アプリケーションに使用する場合は、xref:web.adoc[Web 向け Quarkus] ガイドを参照してください。

source: If you are new to Stork, please read the xref:stork.adoc[Stork Getting Started Guide].
ja_jp: Stork を初めて使用する場合は、xref:stork.adoc[Stork 入門ガイド] をお読みください。

source: If you are not familiar with Ansible, please note that the inventory must be provided for the command above to run properly. This is a simple text file providing the information Ansible requires on the target system it manages. Please refer to the Ansible documentation for more information about https://docs.ansible.com/ansible/latest/inventory_guide/intro_inventory.html[Ansible inventory].
ja_jp: Ansibleに慣れていない場合は、上記のコマンドを正しく実行するためにインベントリを提供する必要があることに注意してください。これは、Ansibleが管理するターゲット・システムに必要な情報を提供する単純なテキスト・ファイルです。 link:https://docs.ansible.com/ansible/latest/inventory_guide/intro_inventory.html[Ansible インベントリ] の詳細については、Ansibleドキュメントを参照してください。

source: If you are not familiar with Kafka and Kafka in Quarkus in particular, consider first going through the xref:kafka.adoc[Using Apache Kafka with Reactive Messaging] guide.
ja_jp: 特に Kafka や Kafka in Quarkus を使い慣れていない場合は、最初に xref:kafka.adoc[リアクティブメッセージングでの Apache Kafka の使用] ガイドを確認することをお勧めします。

source: If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: Mutinyに慣れていない方は、 link:mutiny-primer.html[Mutiny - 直感的なリアクティブプログラミングライブラリ]をご覧ください。

source: If you are not familiar with Mutiny, please check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: Mutinyに慣れていない方は、 link:mutiny-primer.html[Mutiny - 直感的なリアクティブプログラミングライブラリ]をご覧ください。

source: If you are not familiar with the Quarkus Command Mode, consider reading the xref:command-mode-reference.adoc[Command Mode reference guide] first.
ja_jp: Quarkus のコマンドモードに詳しくない場合は、まず link:command-mode-reference[コマンドモードのリファレンスガイド] を読むことを検討してください。

source: If you are not familiar with the Quarkus Vert.x extension, consider reading the xref:vertx.adoc[Using Eclipse Vert.x] guide first.
ja_jp: Quarkus Vert.x エクステンションに慣れていない場合は、まず xref:vertx.adoc[Using Eclipse Vert.x] ガイドを読むことを検討してください。

source: If you are not in one of these cases, the compression fails.
ja_jp: これらのケースに該当しない場合、圧縮は失敗します。

source: If you are not using 1.10 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.10[1.10 migration guide].
ja_jp: まだ1.10をお使いでない方は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.10[1.10移行ガイド] をご参照ください。

source: If you are not using 1.11 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.11[1.11 migration guide].
ja_jp: まだ1.11を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.11[1.11移行ガイド] を参照してください。

source: If you are not using 1.12 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.12[1.12 migration guide].
ja_jp: まだ1.12を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.12[1.12移行ガイド]を参照してください。

source: If you are not using 1.13 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.13[1.13 migration guide].
ja_jp: まだ1.13を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.13[1.13移行ガイド]を参照してください。

source: If you are not using 1.9 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.9[1.9 migration guide].
ja_jp: まだ1.9を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.9[1.9移行ガイド]を参照してください。

source: If you are not using 2.0 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.0[2.0 migration guide].
ja_jp: まだ2.0をお使いでない方は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.0[2.0移行ガイド]をご参照ください。

source: If you are not using 2.1 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.1[2.1 migration guide].
ja_jp: まだ2.1を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.1[2.1移行ガイド]を参照してください。

source: If you are not using 2.10 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.10[2.10 migration guide].
ja_jp: まだ2.10をお使いでない方は、 https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.10[2.10移行ガイド]をご参照ください。

source: If you are not using 2.2 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.2[2.2 migration guide].
ja_jp: まだ2.2を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.2[2.2移行ガイド]を参照してください。

source: If you are not using 2.3 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.3[2.3 migration guide].
ja_jp: まだ2.3を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.3[2.3移行ガイド]を参照してください。

source: If you are not using 2.4 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.4[2.4 migration guide].
ja_jp: まだ2.4を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.4[2.4移行ガイド]を参照してください。

source: If you are not using 2.5 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.5[2.5 migration guide].
ja_jp: まだ2.5を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.5[2.5移行ガイド]を参照してください。

source: If you are not using 2.6 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.6[2.6 migration guide].
ja_jp: まだ2.6を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.6[2.6移行ガイド]を参照してください。

source: If you are not using 2.7 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.7[2.7 migration guide].
ja_jp: まだ2.7を使用していない場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.7[2.7移行ガイド]を参照してください。

source: If you are not using 2.8 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.8[2.8 migration guide].
ja_jp: まだ2.8をお使いでない方は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.8[2.8移行ガイド]をご参照ください。

source: If you are not using 2.9 already, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.9[2.9 migration guide].
ja_jp: 2.9 をまだ使用していない場合は、 https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.9[2.9 移行ガイド] を参照してください。

source: If you are not using Keycloak, or if Keycloak is configured without Keycloak Authorization Services, use the `quarkus-oidc` extension instead.
ja_jp: Keycloak を使用していない場合、または Keycloak が Keycloak Authorization Services なしで設定されている場合は、代わりに `quarkus-oidc` エクステンションを使用します。

source: If you are not using Keycloak, or if Keycloak is configured without the Keycloak Authorization Services feature, use the `quarkus-oidc` extension instead.
ja_jp: Keycloakを使用していない場合、またはKeycloak 認可サービス機能を使用せずにKeycloakが設定されている場合は、代わりに `quarkus-oidc` エクステンションを使用してください。

source: If you are not using any of them and you want to enable SSL support anyway, please add the following to your configuration:
ja_jp: いずれも使用しておらず、とにかくSSLサポートを有効にしたい場合は、以下を設定に追加してください。

source: If you are not using the CLI and using Gradle, use the Quarkus Gradle plugin to do so:
ja_jp: CLIを使用せず、Gradleを使用している場合は、Quarkus Gradleプラグインを使用して実施してください：

source: If you are not using the CLI and using Maven, use the Quarkus Maven plugin to update your projects:
ja_jp: CLIを使用せず、Mavenを使用している場合は、Quarkus Mavenプラグインを使用してプロジェクトを更新してください：

source: If you are not using the CLI, you can use a Maven command directly:
ja_jp: CLIを使用しない場合、Mavenコマンドを直接使用することができます：

source: If you are on Windows, and the command line exceeds 8190 characters, Quarkus automatically uses an argument file to pass the arguments to the `protoc` command.
ja_jp: Windows でコマンドラインが 8190 文字を超える場合、Quarkus は自動的に引数ファイルを使用して引数を `protoc` コマンドに渡します。

source: If you are pulling images across other {openshift} projects or from secured registries, additional configuration steps might be required.
ja_jp: 他の {openshift} プロジェクトや保護されたレジストリからイメージを引っ張ってくる場合は、追加の設定手順が必要になるかもしれません。

source: If you are pulling images across other {openshift} projects or from secured registries, additional configuration steps might be required. For more information, see the link:https://docs.openshift.com/container-platform/[Red Hat Openshift Container Platform] documentation.
ja_jp: 他の {openshift} プロジェクトにまたがるイメージや、保護されたレジストリからイメージをプルする場合は、追加の設定手順が必要になる場合があります。 詳細については、 link:https://docs.openshift.com/container-platform/[Red Hat Openshift Container Platform] のドキュメントを参照してください。

source: If you are retiring or renaming a published Quarkus AsciiDoc source file, ensure that the restructure does not break existing bookmarks and links to the original content. Configure a URL redirect in the link:https://github.com/quarkusio/quarkusio.github.io/[Quarkus.io Website] GitHub repository by using the following steps:
ja_jp: 公開済みの Quarkus AsciiDoc ソースファイルを廃止または名前変更する場合は、再構築によって既存のブックマークや元のコンテンツへのリンクが壊れないように注意してください。 次の手順に従って、link:https://github.com/quarkusio/quarkusio.github.io/[Quarkus.io Web サイト] GitHub リポジトリーで URL リダイレクトを設定します。

source: If you are running a Docker instance, you can use xref:infinispan-dev-services.adoc[Infinispan Dev Services] and connect without configuration.
ja_jp: Dockerインスタンスを実行している場合は、 xref:infinispan-dev-services.adoc[Infinispan Dev Services] を使用して設定なしで接続できます。

source: If you are running an Infinispan Server add the following properties to connect:
ja_jp: Infinispan Serverを起動している場合、以下のプロパティを追加して接続します。

source: If you are running an Infinispan Server, add the following properties to connect in the `application.properties` file in the `src/main/resources` directory.
ja_jp: Infinispan サーバーを実行している場合、 `src/main/resources` ディレクトリの `application.properties` ファイルに接続するための以下のプロパティを追加します。

source: If you are running on a Windows machine, please keep in mind that the binary was created within a Linux docker container. Hence, the binary will not be executable on the host Windows machine.
ja_jp: Windows マシンで実行している場合は、バイナリーが Linux docker コンテナー内で作成されていることに注意してください。つまり、バイナリーはホスト Windows マシンでは実行できません。

source: If you are running your Quarkus application in OpenShift or Kubernetes then try setting this environment variable in your `+Deployment+` or `+DeploymentConfig+`, nested within the `+Spec+` for the application's `+Container+`. This method of enabling JMX does not require the Quarkus application to be rebuilt, only to be redeployed.
ja_jp: OpenShiftまたはKubernetesでQuarkusアプリケーションを実行している場合、この環境変数を、アプリケーション `Container` の `Spec` 内の `Deployment` もしくは `DeploymentConfig` で `+Spec+` にネストして設定してみてください 。この方法でJMXを有効にすると、Quarkusアプリケーションを再構築する必要はなく、再デプロイするだけです。

source: If you are running your own instance of https://github.com/quarkusio/code.quarkus.io[code.quarkus.io] internally, you will want to update to this version to avoid issues.
ja_jp: link:https://github.com/quarkusio/code.quarkus.io[code.quarkus.io]の独自のインスタンスを内部で実行している場合は、問題を回避するためにこのバージョンにアップデートすることをお勧めします。

source: If you are still using UBI 8 images for building or running your Quarkus applications, we strongly recommend you to migrate to the UBI 9-based images as soon as possible. If you have a very specific need to stay on UBI 8, please reach out to us.
ja_jp: Quarkus アプリケーションのビルドまたは実行にまだ UBI 8 イメージを使用している場合は、できるだけ早く UBI 9 ベースのイメージに移行することを強くお勧めします。UBI 8 に留まる必要がある特定の理由がある場合は、お問い合わせください。

source: If you are storing them in form input elements, you can then use the `WebAuthnLoginResponse` and `WebAuthnRegistrationResponse` classes, mark them as `@BeanParam` and then use the `WebAuthnSecurity.login` and `WebAuthnSecurity.register` methods. For example, here's how you can handle a custom login and register:
ja_jp: フォームの入力要素に格納する場合は、 `WebAuthnLoginResponse` と `WebAuthnRegistrationResponse` クラスを使用し、 `@BeanParam` としてマークし、 `WebAuthnSecurity.login` と `WebAuthnSecurity.register` のメソッドを使用します。例えば、カスタムログインとカスタム登録を処理する方法は以下のとおりです。

source: If you are storing them in form input elements, you can then use the link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnLoginResponse.html[`WebAuthnLoginResponse`] and link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnRegistrationResponse.html[`WebAuthnRegistrationResponse`] classes, mark them as `@BeanParam` and then use the link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html#login(io.quarkus.security.webauthn.WebAuthnLoginResponse,io.vertx.ext.web.RoutingContext)[`WebAuthnSecurity.login`] and link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html#register(io.quarkus.security.webauthn.WebAuthnRegisterResponse,io.vertx.ext.web.RoutingContext)[`WebAuthnSecurity.register`] methods to replace the `/q/webauthn/login` and `/q/webauthn/register` endpoints.
ja_jp: フォーム入力要素に保存する場合、link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnLoginResponse.html[`WebAuthnLoginResponse`] および link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnRegistrationResponse.html[`WebAuthnRegistrationResponse`] クラスを使用し、 それらに `@BeanParam` を付与することで link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html#login(io.quarkus.security.webauthn.WebAuthnLoginResponse,io.vertx.ext.web.RoutingContext)[`WebAuthnSecurity.login`] および link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html#register(io.quarkus.security.webauthn.WebAuthnRegisterResponse,io.vertx.ext.web.RoutingContext)[`WebAuthnSecurity.register`] メソッドを使用して、 `/q/webauthn/login` および `/q/webauthn/register` エンドポイントを置き換えることができます。

source: If you are testing your application with `sam local` you can hardcode a principal name to use when your application runs by setting the `QUARKUS_AWS_LAMBDA_FORCE_USER_NAME` environment variable
ja_jp: `sam local` を使用してアプリケーションをテストしている場合は、 `QUARKUS_AWS_LAMBDA_FORCE_USER_NAME` 環境変数を設定することで、アプリケーションの実行時に使用するプリンシパル名をハードコーディングできます。

source: If you are upgrading from 3.32, there's nothing to do as 3.33 LTS is the direct continuation of 3.32.
ja_jp: 3.32からアップグレードする場合、3.33 LTSは3.32の直接的な継続であるため、何もする必要はありません。

source: If you are upgrading from the previous LTS, Quarkus 3.27 LTS, please refer to the following migration guides:
ja_jp: 以前のLTSであるQuarkus 3.27 LTSからアップグレードする場合は、以下の移行ガイドを参照してください。

source: If you are using <<kafka-dev-services>>, a Kafka broker will be started and available throughout the tests, unless it is disabled in `%test` profile. While it is possible to connect to this broker using Kafka Clients API, https://smallrye.io/smallrye-reactive-messaging/latest/kafka/test-companion/[Kafka Companion Library] proposes an easier way of interacting with a Kafka broker and, creating consumer, producer and admin actions inside tests.
ja_jp: <<kafka-dev-services>> を使用している場合、 `%test` プロファイルで無効になっていない限り、Kafka ブローカーが起動し、テスト全体で利用できます。 Kafka Clients API を使用してこのブローカーに接続することは可能ですが、 https://smallrye.io/smallrye-reactive-messaging/latest/kafka/test-companion/[Kafka Companion Library] では、Kafka ブローカーと対話し、テスト内でコンシューマー、プロデューサー、および管理アクションを作成する簡単な方法を提案しています。

source: If you are using Elasticsearch, Quarkus 2.8 comes with Elasticsearch Dev Services, which can automatically start an Elasticsearch container in dev and test mode.
ja_jp: Elasticsearchを使用している場合、Quarkus 2.8にはElasticsearch Dev Servicesが付属しており、開発モードとテストモードでElasticsearchコンテナを自動的に起動することができます。

source: If you are using Gradle in your project, you can use this sample Dockerfile. Save it in `src/main/docker/Dockerfile.multistage`.
ja_jp: プロジェクトでGradleを使用している場合は、このサンプルDockerfileを使用することができます。 `src/main/docker/Dockerfile.multistage` に保存してください。

source: If you are using Gradle, add this to your `build.gradle`:
ja_jp: Gradleを使用している場合は、 `build.gradle` にこれを追加します。

source: If you are using Gradle, the Gradle setting `rootProject.name` has precedence over `quarkus.application.name` so be sure to set the Gradle property to the application name you want the Spring Cloud Config server to see.
ja_jp: Gradleを使用している場合、Gradleの設定 `rootProject.name` は `quarkus.application.name` よりも優先されるため、GradleプロパティにSpring Cloud Configサーバーに表示させたいアプリケーション名を設定してください。

source: If you are using Gradle, the migration is not yet embedded in the Quarkus tooling but we have a JBang script for you:
ja_jp: Gradleを使用している場合、マイグレーションはまだQuarkusのツールに組み込まれていませんが、JBangスクリプトを用意しています：

source: If you are using Gradle, you can use the following configuration:
ja_jp: Gradle を使用している場合は、以下の設定を使用できます。

source: If you are using Hibernate ORM or Hibernate Reactive, please make sure you have a look to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[dedicated migration guide].
ja_jp: Hibernate ORMまたはHibernate Reactiveをお使いの場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[専用の移行ガイド] をご覧ください。

source: If you are using Hibernate ORM, the datasource will be consumed automatically.
ja_jp: Hibernate ORM を使用している場合、データソースは自動的に消費されます。

source: If you are using Keycloak and observe the issuer verification errors caused by the different host addresses, configure Keycloak with a `KEYCLOAK_FRONTEND_URL` property to ensure the same host address is used.
ja_jp: Keycloak を使用していて、ホストアドレスが異なるために発行者検証エラーが発生する場合は、Keycloak に `KEYCLOAK_FRONTEND_URL` プロパティーを設定して、同じホストアドレスを使用してください。

source: If you are using Maven and the Quarkus CLI, update your Quarkus CLI to 3.0.0.CR1 and run the following command:
ja_jp: MavenとQuarkus CLIを使用している場合は、Quarkus CLIを3.0.0.CR1にアップデートし、次のコマンドを実行します：

source: If you are using Maven, make sure you have the `generate-code` goal of `quarkus-maven-plugin` enabled in your `pom.xml`. If you wish to generate code from different `proto` files for tests, also add the `generate-code-tests` goal. Please note that no additional task/goal is required for the Gradle plugin.
ja_jp: Maven を使用している場合は、 `pom.xml` で `quarkus-maven-plugin` の `generate-code` ゴールが有効になっていることを確認してください。 テスト用に異なる `proto` ファイルからコードを生成したい場合は、 `generate-code-tests` ゴールも追加してください。 Gradle プラグインには追加のタスク/ゴールは必要ありません。

source: If you are using MongoDB with Panache and Kotlin, please add the `quarkus-mongodb-panache-kotlin` extension to your project.
ja_jp: MongoDBをPanacheとKotlinで使用している場合は、 `quarkus-mongodb-panache-kotlin` のエクステンションをプロジェクトに追加してください。

source: If you are using Quarkus REST (formerly RESTEasy Reactive) via the `quarkus-rest` extension, then in your `pom.xml` file, add:
ja_jp: `quarkus-rest` エクステンションを介して Quarkus REST (旧 RESTEasy Reactive) を使用している場合は、`pom.xml` ファイルに以下を追加します。

source: If you are using Quarkus REST and Jakarta REST, you can inject various AWS Context variables into your Jakarta REST resource classes using the Jakarta REST `@Context` annotation or anywhere else with the CDI `@Inject` annotation.
ja_jp: Quarkus REST と Jakarta REST を使用している場合、Jakarta REST `@Context` アノテーションを使用して Jakarta REST リソースクラスに、 CDI `@Inject` アノテーションを使用して他の場所にさまざまな AWS Context 変数を注入できます。

source: If you are using Quarkus REST or RESTEasy Classic, in the context of a Jakarta REST endpoint, Hibernate Validator will automatically resolve the optimal locale to use from the `Accept-Language` HTTP header, provided the supported locales have been properly specified in the `application.properties`:
ja_jp: Jakarta REST エンドポイントのコンテキストでQuarkus REST または RESTEasy Classic を使用している場合、 サポートされているロケールが `application.properties` で適切に指定されていれば、Hibernate Validator は `Accept-Language` HTTP ヘッダーから使用する最適なロケールを自動的に解決します：

source: If you are using Quarkus Security, check out the xref:security-testing.adoc[Testing Security] section for information on how to easily test security features of the application.
ja_jp: Quarkus Securityを使用している場合、アプリケーションのセキュリティー機能を簡単にテストする方法については、xref:security-testing.adoc[セキュリティーのテスト] のセクションをご覧ください。

source: If you are using Quarkus and would like to be interviewed on our blog or simply added to this file, please contact us and we will be happy to oblige.
ja_jp: Quarkusをご利用の方で、ブログで取材を受けたい方や、このファイルに単純に追加したい方は、ご連絡いただければ、喜んでお受けいたします。

source: If you are using Qute, our template engine, you will be pleased to see our shiny new error pages, which points you to the error and makes you even more productive:
ja_jp: テンプレートエンジンのQuteをお使いの方は、ピカピカのエラーページをご覧になって喜んでいただけると思います。これがエラーを指摘し、さらに生産性を高めてくれます。

source: If you are using RESTEasy Reactive and JAX-RS, you can inject various AWS Context variables into your JAX-RS resource classes using the JAX-RS `@Context` annotation or anywhere else with the CDI `@Inject` annotation.
ja_jp: RESTEasy Reactive と JAX-RS を使用している場合は、JAX-RS `@Context` アノテーションを使用するか、CDI `@Inject` アノテーションを使用して、さまざまな AWS Context 変数を JAX-RS リソースクラスに挿入できます。

source: If you are using RESTEasy Reactive and Jakarta REST, you can inject various AWS Context variables into your Jakarta REST resource classes using the Jakarta REST `@Context` annotation or anywhere else with the CDI `@Inject` annotation.
ja_jp: RESTEasy ReactiveとJakarta RESTを使用している場合、Jakarta REST `@Context` アノテーションを使用してJakarta RESTリソースクラスに、CDI `@Inject` アノテーションを使用して他の場所に様々なAWS Context変数を注入することができます。

source: If you are using RESTEasy Reactive or RESTEasy Classic, in the context of a JAX-RS endpoint, Hibernate Validator will automatically resolve the optimal locale to use from the `Accept-Language` HTTP header, provided the supported locales have been properly specified in the `application.properties`:
ja_jp: RESTEasy ReactiveあるいはRESTEasy Classicを使用している場合、JAX-RSエンドポイントのコンテキストでは、 サポートされるロケールが `application.properties` で適切に指定されている場合、Hibernate Validatorは使用する最適なロケールを `Accept-Language` HTTPヘッダから自動的に解決します。

source: If you are using RESTEasy Reactive or RESTEasy Classic, in the context of a Jakarta REST endpoint, Hibernate Validator will automatically resolve the optimal locale to use from the `Accept-Language` HTTP header, provided the supported locales have been properly specified in the `application.properties`:
ja_jp: RESTEasy Reactive または RESTEasy Classic を使用している場合、Jakarta REST エンドポイントのコンテキストで、サポートされているロケールが `application.properties` で適切に指定されていれば、Hibernate Validator は `Accept-Language` HTTP ヘッダーから使用する最適なロケールを自動的に解決します:
